export const Hiragana: Array<string> = [
  'あ', 'い', 'う', 'え', 'お',
  'か', 'き', 'く', 'け', 'こ',
  'さ', 'し', 'す', 'せ', 'そ',
  'た', 'ち', 'つ', 'て', 'と',
  'な', 'に', 'ぬ', 'ね', 'の',
  'は', 'ひ', 'ふ', 'へ', 'ほ',
  'ま', 'み', 'む', 'め', 'も',
  'や', '-' , 'ゆ', '-' , 'よ',
  'ら', 'り', 'る', 'れ', 'ろ',
  'わ', '-' , '-' , '-' , 'を',
  'ん',
  'が', 'ぎ', 'ぐ', 'げ', 'ご',
  'ざ', 'じ', 'ず', 'ぜ', 'ぞ',
  'だ', 'ぢ', 'づ', 'で', 'ど',
  'ば', 'び', 'ぶ', 'べ', 'ぼ',
  'ぱ', 'ぴ', 'ぷ', 'ぺ', 'ぽ',
  'ぁ', 'ぃ', 'ぅ', 'ぇ', 'ぉ'
]

export const Romanji: Array<string> = [
  'A', 'I', 'U', 'E', 'O',
  'KA', 'KI', 'KU', 'KE', 'KO',
  'SA', 'SHI', 'SU', 'SE', 'SO',
  'TA', 'CHI', 'TSU', 'TE', 'TO',
  'NA', 'NI', 'NU', 'NE', 'NO',
  'HA', 'HI', 'FU', 'HE', 'HO',
  'MA', 'MI', 'MU', 'ME', 'MO',
  'YA', '-' , 'YU', '-' , 'YO',
  'RA', 'RI', 'RU', 'RE', 'RO',
  'WA', '-', '-' , '-', 'WO',
  'N',
  'GA', 'GI', 'GU', 'GE', 'GO',
  'ZA', 'JI', 'ZU', 'ZE', 'ZO',
  'DA', 'JI', 'ZU', 'DE', 'DO',
  'BA', 'BI', 'BU', 'BE', 'BO',
  'PA', 'PI', 'PU', 'PE', 'PO',
  'ぁ', 'ぃ', 'ぅ', 'ぇ', 'ぉ'
]
